import math
import random

# Напишите программу, которая принимает на вход 
# координаты двух точек и находит расстояние между ними
#  в 2D пространстве.

print('\ntask5:\nНапишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.\n')

# xA = int(input('Enter points of A in 2D:\n'))
# yA = int(input())
# xB = int(input('Enter points of B in 2D:\n'))
# yB = int(input())
xA,yA,xB,yB = map(int, input('Введите точки через пробел: ').split())
print(round(math.sqrt(((xB - xA)**2)+((yB - yA)**2)),2))


# ********************************************************************************************************************************************************************************************************************************************************************************


# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
print('\ntask1:\nЗадайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.')

# def funk_sum(arr):
#     sum = 0
#     for i in range(1,len(arr),2):
#         sum+=arr[i]
#     return sum

arr = input("Enter a arr(separate by ','): ")
split_arr = [int(i) for i in arr.split(',')]
print(split_arr)
# print(funk_sum(split_arr))

print(sum(x for i, x in enumerate(split_arr) if i % 2 != 0))


# ********************************************************************************************************************************************************************************************************************************************************************************


# Реализуйте алгоритм перемешивания списка.
print('\ntask5:\nАлгоритм перемешивания списка.')

# def mix_arr(arr):
#     for i in range(len(arr)-1, -1, -1):
#         j = random.randint(0, len(arr)-1)
#         arr[i], arr[j] = arr[j], arr[i]
#     return arr

arr = input("Enter a arr(separate by ','): ")
split_arr = [int(i) for i in arr.split(',')]
print(split_arr)
# print(mix_arr(split_arr))

print(sorted(split_arr, key=lambda x: random.random()))


